zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
/**
  ******************************************************************************
  * @file    stm32h5xx_hal_dma2d.h
  * @author  MCD Application Team
  * @brief   Header file of DMA2D HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H5xx_HAL_DMA2D_H
#define STM32H5xx_HAL_DMA2D_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal_def.h"

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */

#if defined (DMA2D)

/** @addtogroup DMA2D DMA2D
  * @brief DMA2D HAL module driver
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup DMA2D_Exported_Types DMA2D Exported Types
  * @{
  */
#define MAX_DMA2D_LAYER  2U  /*!< DMA2D maximum number of layers */
/**
  * @brief DMA2D Ring Buffer Structure definition
  */
typedef struct
{
  uint32_t  Size;         /*!< The Ring Buffer Size can be value from @ref DMA2D_RB_Size */
  uint32_t *Address;      /*!< The Ring Buffer Base Address */
} DMA2D_CL_RingBufferTypeDef;

/**
  * @brief DMA2D Command List Structure definition
  */
typedef struct
{
  uint32_t Size;           /*!< The Command List Size            */
  uint32_t *Address;       /*!< The Command List Base Address    */
  uint32_t Index;          /*!< The Current Command List Address */
} DMA2D_CL_CommandListTypeDef;
/**
  * @brief DMA2D Stencil Configuration Structure definition
  */
typedef struct
{
  uint32_t Mode;     /*!< The Stencil buffer mode                                      */
  uint32_t AlphaInverted;    /*!< The alpha value                                      */
  uint32_t Address;         /*!< The address of the stencil buffer                     */
  uint32_t LineOffset;      /*!< The stencil offset                                    */
  uint32_t HPre;            /*!< The number of skipped pixel at the beginning of a line */
  uint32_t HTrail;          /*!< The number of skipped pixel at the end of a line       */
} DMA2D_StencilCfgTypeDef;

/**
  * @brief DMA2D Downscaling Configuration Structure definition
  */
typedef struct
{
  uint32_t PixelPerLines;   /*!< Source width, in pixels, to be processed by the scaler            */
  uint32_t NumberOfLines;   /*!< Source height, in lines, to be processed by the scaler            */
  uint16_t VRatio;          /*!< The Vertical scaling Ratio                                        */
  uint16_t VRatioDiv;       /*!< The Vertical scaling Ratio divider: The output height is computed
                                 from NumberOfLines * VRatio / VRatioDiv                           */
  uint16_t HRatio;          /*!< Horizontal scaling Ratio                                          */
  uint16_t HRatioDiv;       /*!< Horizontal scaling Ratio divider: The output width is computed
                                 from PixelPerLines * HRatio / HRatioDiv                           */
  uint32_t VPhase;          /*!< Vertical Phase (This allows partial redrawing of scaled images)   */
  uint32_t HPhase;          /*!< Horizontal Phase (This allows partial redrawing of scaled images) */
} DMA2D_DownscalingCfgTypeDef;

/**
  * @brief DMA2D CLUT Structure definition
  */
typedef struct
{
  uint32_t *pCLUT;                  /*!< Configures the DMA2D CLUT memory address.*/

  uint32_t CLUTColorMode;           /*!< Configures the DMA2D CLUT color mode.
                                         This parameter can be one value of @ref DMA2D_Input_Color_Mode. */

  uint32_t Size;                    /*!< Configures the DMA2D CLUT size.
                                         This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF.*/
} DMA2D_CLUTCfgTypeDef;

/**
  * @brief DMA2D Init structure definition
  */
typedef struct
{
  uint32_t             Mode;               /*!< Configures the DMA2D transfer mode.
                                                This parameter can be one value of @ref DMA2D_Mode. */

  uint32_t             ColorMode;          /*!< Configures the color format of the output image.
                                                This parameter can be one value of @ref DMA2D_Output_Color_Mode. */

  uint32_t             OutputOffset;       /*!< Specifies the Offset value.
                                                This parameter must be a number between
                                                Min_Data = 0x0000 and Max_Data = 0x3FFF. */
  uint32_t             AlphaInverted;     /*!< Select regular or inverted alpha value for the output pixel format converter.
                                               This parameter can be one value of @ref DMA2D_Alpha_Inverted. */

  uint32_t             RedBlueSwap;       /*!< Select regular mode (RGB or ARGB) or swap mode (BGR or ABGR)
                                               for the output pixel format converter.
                                               This parameter can be one value of @ref DMA2D_RB_Swap. */

  uint32_t             AlphaPosition;      /*!< Select Alpha position (ARGB or ABGR) or (RGBA or BGRA)
                                               for the output pixel format converter.
                                               This parameter can be one value of @ref DMA2D_Alpha_Position. */

  uint32_t             BytesSwap;         /*!< Select byte regular mode or bytes swap mode (two by two).
                                               This parameter can be one value of @ref DMA2D_Bytes_Swap. */

