zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)

  void (* RBXferCpltCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);   /*!< DMA2D Ring Buffer transfer complete
                                                                               callback. */

  void (* CL_SuspendCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);   /*!< DMA2D Command List Suspend callback.   */

  void (* CL_GeneralPurposeEventCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d, uint32_t gen_pur_flag); /*!< DMA2D
                                                                               General Purpose Flag Event callback.   */

  void (* XferErrorCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);       /*!< DMA2D transfer error callback.      */

  void (* XferCpltCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);        /*!< DMA2D transfer complete callback.   */

  void (* LineEventCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);       /*!< DMA2D line event callback.          */

  void (* CLUTLoadingCpltCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d); /*!< DMA2D CLUT loading completion
                                                                                  callback */
  void (* ErrorCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);           /*!< DMA2D Error callback.               */
  void (* MspInitCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);         /*!< DMA2D Msp Init callback.            */

  void (* MspDeInitCallback)(struct __DMA2D_CL_HandleTypeDef *hdma2d);       /*!< DMA2D Msp DeInit callback.          */

#endif /* (USE_HAL_DMA2D_REGISTER_CALLBACKS) */

  __IO HAL_DMA2D_CL_StateTypeDef State;                                   /*!< DMA2D CL transfer state.            */

  __IO uint32_t                  ErrorCode;                                  /*!< DMA2D CL error code.                */

} DMA2D_CL_HandleTypeDef;
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 1 */
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL DMA2D Callback pointer definition
  */
#if (USE_DMA2D_COMMAND_LIST_MODE == 0)
typedef void (*pDMA2D_CallbackTypeDef)(DMA2D_HandleTypeDef *hdma2d); /*!< Pointer to a DMA2D common callback function */
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 0 */
#if (USE_DMA2D_COMMAND_LIST_MODE == 1)
typedef void (*pDMA2D_CL_CallbackTypeDef)(DMA2D_CL_HandleTypeDef *hdma2d); /*!< Pointer to a DMA2D_CL common callback function */
typedef void (*pDMA2D_CL_GeneralPurposeEventCallbackTypeDef)(DMA2D_CL_HandleTypeDef *hdma2d, uint32_t gen_pur_flag); /*!< Pointer to a DMA2D_CL GEN_PURP_flags common callback function */
#endif /* USE_DMA2D_COMMAND_LIST_MODE == 1 */
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup DMA2D_Exported_Constants DMA2D Exported Constants
  * @{
  */

/** @defgroup DMA2D_Error_Code DMA2D Error Code
  * @{
  */
#define HAL_DMA2D_ERROR_NONE        0x00000000U  /*!< No error             */
#define HAL_DMA2D_ERROR_TE          0x00000001U  /*!< Transfer error       */
#define HAL_DMA2D_ERROR_CE          0x00000002U  /*!< Configuration error  */
#define HAL_DMA2D_ERROR_CAE         0x00000004U  /*!< CLUT access error    */
#define HAL_DMA2D_ERROR_TIMEOUT     0x00000020U  /*!< Timeout error        */
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
#define HAL_DMA2D_ERROR_INVALID_CALLBACK 0x00000040U  /*!< Invalid callback error  */
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
#define HAL_DMA2D_ERROR_CLE         0x00000080U  /*!<* Command List Error  */
#define HAL_DMA2D_ERROR_RBE         0x00000100U  /*!<* Ring Buffer Error   */
#define HAL_DMA2D_ERROR_LCLMSE      0x00000200U  /*!<* Linear command list multiple start error */
#define HAL_DMA2D_ERROR_LCLIE       0x00000400U  /*!<* Linear command list instruction error    */
#define HAL_DMA2D_ERROR_LCLRE       0x00000800U  /*!<* Linear command list read error           */

/**
  * @}
  */

/** @defgroup DMA2D_Mode DMA2D Mode
  * @{
  */
#define DMA2D_M2M                   0x00000000U                         /*!< DMA2D memory to memory transfer mode */
#define DMA2D_M2M_PFC               DMA2D_CR_MODE_0                     /*!< DMA2D memory to memory with pixel format conversion transfer mode */
#define DMA2D_M2M_BLEND             DMA2D_CR_MODE_1                     /*!< DMA2D memory to memory with blending transfer mode */
#define DMA2D_R2M                   (DMA2D_CR_MODE_1 | DMA2D_CR_MODE_0) /*!< DMA2D register to memory transfer mode */
#define DMA2D_M2M_BLEND_FG          DMA2D_CR_MODE_2                     /*!< DMA2D memory to memory with blending transfer mode and fixed color FG */
#define DMA2D_M2M_BLEND_BG          (DMA2D_CR_MODE_2 | DMA2D_CR_MODE_0) /*!< DMA2D memory to memory with blending transfer mode and fixed color BG */
/**
  * @}
  */

/** @defgroup DMA2D_Output_Color_Mode DMA2D Output Color Mode
  * @{
  */
#define DMA2D_OUTPUT_ARGB8888       0x00000000U                           /*!< ARGB8888 DMA2D color mode */
#define DMA2D_OUTPUT_RGB888         DMA2D_OPFCCR_CM_0                     /*!< RGB888 DMA2D color mode   */
#define DMA2D_OUTPUT_RGB565         DMA2D_OPFCCR_CM_1                     /*!< RGB565 DMA2D color mode   */
#define DMA2D_OUTPUT_ARGB1555       (DMA2D_OPFCCR_CM_0|DMA2D_OPFCCR_CM_1) /*!< ARGB1555 DMA2D color mode */
#define DMA2D_OUTPUT_ARGB4444       DMA2D_OPFCCR_CM_2                     /*!< ARGB4444 DMA2D color mode */
#define DMA2D_OUTPUT_ARGB2222       (DMA2D_OPFCCR_CM_1 | DMA2D_OPFCCR_CM_2 | DMA2D_OPFCCR_CM_3) /*!< ARGB2222
                                                                               DMA2D color mode */
/**
  * @}
  */

/** @defgroup DMA2D_Input_Color_Mode DMA2D Input Color Mode
  * @{
  */
#define DMA2D_INPUT_ARGB8888        0x00000000U  /*!< ARGB8888 color mode */
#define DMA2D_INPUT_RGB888          0x00000001U  /*!< RGB888 color mode   */
#define DMA2D_INPUT_RGB565          0x00000002U  /*!< RGB565 color mode   */
#define DMA2D_INPUT_ARGB1555        0x00000003U  /*!< ARGB1555 color mode */
#define DMA2D_INPUT_ARGB4444        0x00000004U  /*!< ARGB4444 color mode */
#define DMA2D_INPUT_L8              0x00000005U  /*!< L8 color mode       */
#define DMA2D_INPUT_AL44            0x00000006U  /*!< AL44 color mode     */
#define DMA2D_INPUT_AL88            0x00000007U  /*!< AL88 color mode     */
#define DMA2D_INPUT_L4              0x00000008U  /*!< L4 color mode       */
#define DMA2D_INPUT_A8              0x00000009U  /*!< A8 color mode       */
#define DMA2D_INPUT_A4              0x0000000AU  /*!< A4 color mode       */
#define DMA2D_INPUT_YCBCR           0x0000000BU  /*!< YCbCr color mode */
#define DMA2D_INPUT_A2              0x0000000CU  /*!< A2 color mode       */
#define DMA2D_INPUT_A1              0x0000000DU  /*!< A1 color mode       */
#define DMA2D_INPUT_ARGB2222        0x0000000EU  /*!< ARGB2222 color mode */
/**
  * @}
  */

