zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
/** @defgroup DMA2D_Input_Color_Mode DMA2D Input Color Mode
  * @{
  */
#define DMA2D_CCM_ARGB8888        0x00000000U  /*!< ARGB8888 CLUT color mode */
#define DMA2D_CCM_RGB888          0x00000001U  /*!< RGB888 CLUT color mode   */
#define DMA2D_CCM_RGB565          0x00000002U  /*!< RGB565 CLUT color mode   */
#define DMA2D_CCM_ARGB1555        0x00000003U  /*!< ARGB1555 CLUT color mode */
#define DMA2D_CCM_ARGB4444        0x00000004U  /*!< ARGB4444 CLUT color mode */
#define DMA2D_CCM_ARGB2222        0x0000000EU  /*!< ARGB2222 CLUT color mode */
/**
  * @}
  */

/** @defgroup DMA2D_Alpha_Mode DMA2D Alpha Mode
  * @{
  */
#define DMA2D_NO_MODIF_ALPHA        0x00000000U  /*!< No modification of the alpha channel value                     */
#define DMA2D_REPLACE_ALPHA         0x00000001U  /*!< Replace original alpha channel value by programmed alpha value */
#define DMA2D_COMBINE_ALPHA         0x00000002U  /*!< Replace original alpha channel value by programmed alpha value
                                                      with original alpha channel value                              */
/**
  * @}
  */

/** @defgroup DMA2D_Alpha_Position DMA2D Alpha Position
  * @{
  */
#define DMA2D_REGULAR_ALPHA_POS            0x00000000U  /*!< Select regular mode (ARGB or ABGR) */
#define DMA2D_SWAP_ALPHA_POS               0x00000001U  /*!< Select swap mode (RGBA or BGRA) */
/**
  * @}
  */

/** @defgroup DMA2D_Alpha_Inverted DMA2D Alpha Inversion
  * @{
  */
#define DMA2D_REGULAR_ALPHA         0x00000000U  /*!< No modification of the alpha channel value */
#define DMA2D_INVERTED_ALPHA        0x00000001U  /*!< Invert the alpha channel value */
/**
  * @}
  */

/** @defgroup DMA2D_RB_Swap DMA2D Red and Blue Swap
  * @{
  */
#define DMA2D_RB_REGULAR            0x00000000U  /*!< Select regular mode (RGB or ARGB) */
#define DMA2D_RB_SWAP               0x00000001U  /*!< Select swap mode (BGR or ABGR) */
/**
  * @}
  */



/** @defgroup DMA2D_Line_Offset_Mode DMA2D Line Offset Mode
  * @{
  */
#define DMA2D_LOM_PIXELS            0x00000000U   /*!< Line offsets expressed in pixels */
#define DMA2D_LOM_BYTES             DMA2D_CR_LOM  /*!< Line offsets expressed in bytes */
/**
  * @}
  */

/** @defgroup DMA2D_Bytes_Swap DMA2D Bytes Swap
  * @{
  */
#define DMA2D_BYTES_REGULAR         0x00000000U      /*!< Bytes in regular order in output FIFO */
#define DMA2D_BYTES_SWAP            DMA2D_OPFCCR_SB  /*!< Bytes are swapped two by two in output FIFO */
/**
  * @}
  */

/** @defgroup DMA2D_Chroma_Sub_Sampling DMA2D Chroma Sub Sampling
  * @{
  */
#define DMA2D_NO_CSS               0x00000000U  /*!< No chroma sub-sampling 4:4:4 */
#define DMA2D_CSS_422              0x00000001U  /*!< chroma sub-sampling 4:2:2 */
#define DMA2D_CSS_420              0x00000002U  /*!< chroma sub-sampling 4:2:0 */
/**
  * @}
  */

/** @defgroup DMA2D_SOURCE DMA2D Source
  * @{
  */
#define DMA2D_SOURCE_NONE                   0x00000000U  /*!< No Source (Disabled)    */
#define DMA2D_SOURCE_FOREGROUND             0x00000001U  /*!< Foreground plane Source */
#define DMA2D_SOURCE_BACKGROUND             0x00000002U  /*!< Background plane        */
#define DMA2D_SOURCE_BLENDER_OUTPUT         0x00000003U  /*!< Blender output          */
/**
  * @}
  */
/** @defgroup DMA2D_COLOR_MODE DMA2D Color Mode
  * @{
  */
#define DMA2D_STENCIL_MODE_A1         0x00000000U  /*!<  */
#define DMA2D_STENCIL_MODE_A2         0x00000001U  /*!< */
#define DMA2D_STENCIL_MODE_A4         0x00000002U  /*!< */
#define DMA2D_STENCIL_MODE_A8         0x00000003U  /*!< */
/**
  * @}
  */
/** @defgroup DMA2D_MirroringRotation DMA2D Mirroring Rotation
  * @{
  */
#define DMA2D_NO_ROTATION      0    /*!< No X, Y Swap , no mirroring                 */
#define DMA2D_NO_ROTATION_FLIP 0x01 /*!< Horizontal mirroring (X-axis flip)          */
#define DMA2D_ROTATE_90        0x05 /*!< 90 degree rotation                          */
#define DMA2D_ROTATE_90_FLIP   0x04 /*!< -90 degree rotation with vertical mirroring */
#define DMA2D_ROTATE_180       0x03 /*!< Both X and Y mirrored (Rotation 180)        */
#define DMA2D_ROTATE_180_FLIP  0x02 /*!< Vertical mirroring (Y-axis flip)            */
#define DMA2D_ROTATE_270       0x06 /*!< -90 degree rotation (X/Y swapped)           */
#define DMA2D_ROTATE_270_FLIP  0x07 /*!< 90 degree rotation with full mirroring      */
/**
  * @}
  */
/** @defgroup DMA2D_RB_Size DMA2D Ring Buffer Size
  * @{
  */
#define DMA2D_RB_SIZE_64B    0x0  /*!< Ring buffer size 64 bytes (2^(0+6))   */
#define DMA2D_RB_SIZE_128B   0x1  /*!< Ring buffer size 128 bytes (2^(1+6))  */
#define DMA2D_RB_SIZE_256B   0x2  /*!< Ring buffer size 256 bytes (2^(2+6))  */
#define DMA2D_RB_SIZE_512B   0x3  /*!< Ring buffer size 512 bytes (2^(3+6))  */
#define DMA2D_RB_SIZE_1KB    0x4  /*!< Ring buffer size 1024 bytes (2^(4+6)) */
#define DMA2D_RB_SIZE_2KB    0x5  /*!< Ring buffer size 2048 bytes (2^(5+6)) */
#define DMA2D_RB_SIZE_4KB    0x6  /*!< Ring buffer size 4096 bytes (2^(6+6)) */
#define DMA2D_RB_SIZE_8KB    0x7  /*!< Ring buffer size 8192 bytes (2^(7+6)) */

/**
  * @}
  */

/** @defgroup DMA2D_GENERAL_PURPOSE_FLAGS DMA2D General Purpose Flags
  * @{
  */
#define DMA2D_GPFLAG0     0  /*!< General Purpose Flag 0 */
#define DMA2D_GPFLAG1     1  /*!< General Purpose Flag 1 */
#define DMA2D_GPFLAG2     2  /*!< General Purpose Flag 2 */
#define DMA2D_GPFLAG3     3  /*!< General Purpose Flag 3 */
/**
  * @}
  */

/** @defgroup DMA2D_GENERAL_PURPOSE_FLAG_OPERATION DMA2D General Purpose Flag Operation
  * @{
  */
#define DMA2D_GPFLAG_NOP     0  /*!< No Operation to be done on General Purpose Flag  */
#define DMA2D_GPFLAG_SET     1  /*!< Set Operation to be done on General Purpose Flag */
#define DMA2D_GPFLAG_RESET   2  /*!< Reset operation to be done on General Purpose Flag  */
#define DMA2D_GPFLAG_TOGGLE  4  /*!< Toggle operation to be done on General Purpose Flag */
/**
  * @}
  */

/** @defgroup DMA2D_GENERAL_PURPOSE_INTERRUPT_MODE DMA2D General Purpose Interrupt Mode
  * @{
  */
#define DMA2D_GPFLAG_NONE            0  /*!< General purpose flag interrupt is never set */
#define DMA2D_GPFLAG_RISING          1  /*!< General purpose flag interrupt is set on a rising edge of the GPF */
#define DMA2D_GPFLAG_FALLING         2  /*!< General purpose flag interrupt is set on a falling edge of the GPF */
#define DMA2D_GPFLAG_RISING_FALLING  3  /*!< General purpose flag interrupt is set on a rising or a falling edge
                                             of the GPF */
/**
  * @}
  */
/** @defgroup DMA2D_Interrupts DMA2D Interrupts
  * @{
  */
#define DMA2D_IT_CE                 DMA2D_IER_CEIE            /*!< Configuration Error Interrupt */
#define DMA2D_IT_CTC                DMA2D_IER_CTCIE           /*!< CLUT Transfer Complete Interrupt */
#define DMA2D_IT_CAE                DMA2D_IER_CAEIE           /*!< CLUT Access Error Interrupt */
#define DMA2D_IT_TW                 DMA2D_IER_TWIE            /*!< Transfer Watermark Interrupt */
#define DMA2D_IT_TC                 DMA2D_IER_TCIE            /*!< Transfer Complete Interrupt */
#define DMA2D_IT_TE                 DMA2D_IER_TEIE            /*!< Transfer Error Interrupt */
#define DMA2D_IT_GPF3               DMA2D_IER_GPF3IE           /*!< General Purpose Flag 3 Interrupt */
#define DMA2D_IT_GPF2               DMA2D_IER_GPF2IE           /*!< General Purpose Flag 2 Interrupt */
#define DMA2D_IT_GPF1               DMA2D_IER_GPF1IE           /*!< General Purpose Flag 1 Interrupt */
#define DMA2D_IT_GPF0               DMA2D_IER_GPF0IE           /*!< General Purpose Flag 0 Interrupt */
#define DMA2D_IT_CLE                DMA2D_IER_CLEIE           /*!< Command List Error Interrupt */
#define DMA2D_IT_CLS                DMA2D_IER_CLSIE           /*!< Command List Suspended Interrupt */
#define DMA2D_IT_RBE                DMA2D_IER_RBEIE           /*!< Ring Buffer Error Interrupt */
#define DMA2D_IT_RBC                DMA2D_IER_RBCIE           /*!< Ring Buffer Completed Interrupt */
#define DMA2D_IT_ALL              (DMA2D_IT_CE  | DMA2D_IT_CTC | DMA2D_IT_CAE| DMA2D_IT_TW|  DMA2D_IT_TC|\
                                   DMA2D_IT_TE |DMA2D_IT_GPF3 | DMA2D_IT_GPF2 | DMA2D_IT_GPF1| DMA2D_IT_GPF0|\
                                   DMA2D_IT_CLE |DMA2D_IT_CLS | DMA2D_IT_RBE | DMA2D_IT_RBC) /*!< All Interrupt */
#define DMA2D_IT_NONE               0x0U                     /*!< DMA2D Interrupt None             */
/**
  * @}
  */

/** @defgroup DMA2D_Flags DMA2D Flags
  * @{
  */
#define DMA2D_FLAG_CE               DMA2D_ISR_CEIF           /*!< Configuration Error Interrupt Flag */
#define DMA2D_FLAG_CTC              DMA2D_ISR_CTCIF          /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_FLAG_CAE              DMA2D_ISR_CAEIF          /*!< CLUT Access Error Interrupt Flag */
#define DMA2D_FLAG_TW               DMA2D_ISR_TWIF           /*!< Transfer Watermark Interrupt Flag */
#define DMA2D_FLAG_TC               DMA2D_ISR_TCIF           /*!< Transfer Complete Interrupt Flag */
#define DMA2D_FLAG_TE               DMA2D_ISR_TEIF           /*!< Transfer Error Interrupt Flag */
#define DMA2D_FLAG_GPF3I            DMA2D_ISR_GPF3IF         /*!< General Purpose Flag 3 Interrupt Flag */
#define DMA2D_FLAG_GPF2I            DMA2D_ISR_GPF2IF         /*!< General Purpose Flag 2 Interrupt Flag */
#define DMA2D_FLAG_GPF1I            DMA2D_ISR_GPF1IF         /*!< General Purpose Flag 1 Interrupt Flag */
#define DMA2D_FLAG_GPF0I            DMA2D_ISR_GPF0IF         /*!< General Purpose Flag 0 Interrupt Flag */
#define DMA2D_FLAG_CLE              DMA2D_ISR_CLEIF          /*!< Command List Error Interrupt Flag */
#define DMA2D_FLAG_CLS              DMA2D_ISR_CLSIF          /*!< Command List suspended Interrupt Flag */
#define DMA2D_FLAG_RBE              DMA2D_ISR_RBEIF          /*!< Ring Buffer Error Interrupt Flag */
#define DMA2D_FLAG_RBC              DMA2D_ISR_RBCIF          /*!< Ring Buffer Completed Interrupt Flag */
#define DMA2D_FLAG_LCLMSE           DMA2D_CLSR_LCLMSE        /*!< Linear command list multi start error Interrupt Flag */
#define DMA2D_FLAG_LCLIE            DMA2D_CLSR_LCLIE         /*!< Linear command list instruction error Interrupt Flag */
#define DMA2D_FLAG_LCLRE            DMA2D_CLSR_LCLRE         /*!< Linear command list read error Interrupt Flag*/
#define DMA2D_FLAG_GPF3S            DMA2D_CLSR_GPF3S         /*!< The command list is suspended by GPFLAG 3 Interrupt Flag */
#define DMA2D_FLAG_GPF2S            DMA2D_CLSR_GPF2S         /*!< The command list is suspended by GPFLAG 2 Interrupt Flag */
#define DMA2D_FLAG_GPF1S            DMA2D_CLSR_GPF1S         /*!< The command list is suspended by GPFLAG 1 Interrupt Flag */
#define DMA2D_FLAG_GPF0S            DMA2D_CLSR_GPF0S         /*!< The command list is suspended by GPFLAG 0 Interrupt Flag */
#define DMA2D_FLAG_SUSPS            DMA2D_CLSR_SUSPS         /*!< The command list is suspended by the SUSP bit Interrupt Flag */
#define DMA2D_FLAG_GPF3             DMA2D_GPFR_GPF3          /*!< General Purpose Flag 3 Flag */
#define DMA2D_FLAG_GPF2             DMA2D_GPFR_GPF2          /*!< General Purpose Flag 2 Flag */
#define DMA2D_FLAG_GPF1             DMA2D_GPFR_GPF1          /*!< General Purpose Flag 1 Flag */
#define DMA2D_FLAG_GPF0             DMA2D_GPFR_GPF0          /*!< General Purpose Flag 0 Flag */
/**
  * @}
  */

