zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL DMA2D common Callback ID enumeration definition
  */
typedef enum
{
  HAL_DMA2D_MSPINIT_CB_ID           = 0x00U,    /*!< DMA2D MspInit callback ID                 */
  HAL_DMA2D_MSPDEINIT_CB_ID         = 0x01U,    /*!< DMA2D MspDeInit callback ID               */
  HAL_DMA2D_TRANSFERCOMPLETE_CB_ID  = 0x02U,    /*!< DMA2D transfer complete callback ID       */
  HAL_DMA2D_TRANSFERERROR_CB_ID     = 0x03U,    /*!< DMA2D transfer error callback ID          */
  HAL_DMA2D_LINEEVENT_CB_ID         = 0x04U,    /*!< DMA2D line event callback ID              */
  HAL_DMA2D_CLUTLOADINGCPLT_CB_ID   = 0x05U,    /*!< DMA2D CLUT loading completion callback ID */
} HAL_DMA2D_CallbackIDTypeDef;
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL DMA2D common CL Callback ID enumeration definition
  */
typedef enum
{
  HAL_DMA2D_CL_MSPINIT_CB_ID                     = 0x00U,    /*!< DMA2D MspInit callback ID                 */
  HAL_DMA2D_CL_MSPDEINIT_CB_ID                   = 0x01U,    /*!< DMA2D MspDeInit callback ID               */
  HAL_DMA2D_CL_TRANSFERCOMPLETE_CB_ID            = 0x02U,    /*!< DMA2D transfer complete callback ID       */
  HAL_DMA2D_CL_TRANSFERERROR_CB_ID               = 0x03U,    /*!< DMA2D transfer error callback ID          */
  HAL_DMA2D_CL_LINEEVENT_CB_ID                   = 0x04U,    /*!< DMA2D line event callback ID              */
  HAL_DMA2D_CL_CLUTLOADINGCPLT_CB_ID             = 0x05U,    /*!< DMA2D CLUT loading completion callback ID */
  HAL_DMA2D_CL_SUSPEND_CB_ID                     = 0x06U,    /*!< DMA2D transfer error callback ID          */
  HAL_DMA2D_CL_RINGBUFFERCOMPLETE_CB_ID          = 0x07U,    /*!< DMA2D transfer error callback ID       */
  HAL_DMA2D_CL_GENERALPURPOSEFLAGEVENT_CB_ID     = 0x08U,    /*!< DMA2D transfer error callback ID       */
  HAL_DMA2D_CL_ERROR_CB_ID                       = 0x09U,    /*!< DMA2D transfer error callback ID          */
} HAL_DMA2D_CL_CallbackIDTypeDef;
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */

/**
  * @}
  */
/* Exported macros ------------------------------------------------------------*/
/** @defgroup DMA2D_Exported_Macros DMA2D Exported Macros
  * @{
  */

/** @brief Reset DMA2D handle state
  * @param  __HANDLE__ specifies the DMA2D handle.
  * @retval None
  */
#if (USE_HAL_DMA2D_REGISTER_CALLBACKS == 1)
#define __HAL_DMA2D_RESET_HANDLE_STATE(__HANDLE__) do{                                             \
                                                       (__HANDLE__)->State = HAL_DMA2D_STATE_RESET;\
                                                       (__HANDLE__)->MspInitCallback = NULL;       \
                                                       (__HANDLE__)->MspDeInitCallback = NULL;     \
                                                     }while(0)
#else
#define __HAL_DMA2D_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_DMA2D_STATE_RESET)
#endif /* USE_HAL_DMA2D_REGISTER_CALLBACKS */


/**
  * @brief  Enable the DMA2D.
  * @param  __HANDLE__ DMA2D handle
  * @retval None.
  */
#define __HAL_DMA2D_ENABLE(__HANDLE__)        ((__HANDLE__)->Instance->CR |= DMA2D_CR_START)


/* Interrupt & Flag management */
/**
  * @brief  Get the DMA2D pending flags.
  * @param  __HANDLE__ DMA2D handle
  * @param  __FLAG__ flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_FLAG_CE:  Configuration error flag
  *            @arg DMA2D_FLAG_CTC: CLUT transfer complete flag
  *            @arg DMA2D_FLAG_CAE: CLUT access error flag
  *            @arg DMA2D_FLAG_TW:  Transfer Watermark flag
  *            @arg DMA2D_FLAG_TC:  Transfer complete flag
  *            @arg DMA2D_FLAG_TE:  Transfer error flag
  *            @arg DMA2D_FLAG_GPF3I: General Purpose Flag 3 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF2I: General Purpose Flag 2 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF1I: General Purpose Flag 1 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF0I: General Purpose Flag 0 Interrupt Flag
  *            @arg DMA2D_FLAG_CLE : Command List Error Interrupt Flag
  *            @arg DMA2D_FLAG_CLS : Command List suspended Interrupt Flag
  *            @arg DMA2D_FLAG_RBE : Ring Buffer Error Interrupt Flag
  *            @arg DMA2D_FLAG_RBC : Ring Buffer Completed Interrupt Flag
  * @retval The state of FLAG.
  */
#define __HAL_DMA2D_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR & (__FLAG__))

/**
  * @brief  Clear the DMA2D pending flags.
  * @param  __HANDLE__ DMA2D handle
  * @param  __FLAG__ specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_FLAG_CE:  Configuration error flag
  *            @arg DMA2D_FLAG_CTC: CLUT transfer complete flag
  *            @arg DMA2D_FLAG_CAE: CLUT access error flag
  *            @arg DMA2D_FLAG_TW:  Transfer Watermark flag
  *            @arg DMA2D_FLAG_TC:  Transfer complete flag
  *            @arg DMA2D_FLAG_TE:  Transfer error flag
  *            @arg DMA2D_FLAG_GPF3I:  General Purpose Flag 3 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF2I:  General Purpose Flag 2 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF1I:  General Purpose Flag 1 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF0I:  General Purpose Flag 0 Interrupt Flag
  *            @arg DMA2D_FLAG_CLE :  Command List Error Interrupt Flag
  *            @arg DMA2D_FLAG_CLS :  Command List suspended Interrupt Flag
  *            @arg DMA2D_FLAG_RBE :  Ring Buffer Error Interrupt Flag
  *            @arg DMA2D_FLAG_RBC :  Ring Buffer Completed Interrupt Flag
  * @retval None
  */
#define __HAL_DMA2D_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->IFCR = (__FLAG__))

/**
  * @brief  Clear the DMA2D pending GeneralPurpose flags.
  * @param  __HANDLE__ DMA2D handle
  * @param  __FLAG__ specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_FLAG_GPF3:  General Purpose Flag 3
  *            @arg DMA2D_FLAG_GPF2:  General Purpose Flag 2
  *            @arg DMA2D_FLAG_GPF1:  General Purpose Flag 1
  *            @arg DMA2D_FLAG_GPF0:  General Purpose Flag 0
  * @retval None
  */
#define __HAL_DMA2D_CL_CLEAR_GPFLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->GPFRR = (__FLAG__))
/**
  * @brief  Clear the DMA2D pending flags.
  * @param  __HANDLE__ DMA2D handle
  * @param  __FLAG__ specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_FLAG_LCLMSE:  Linear command list multi start error Interrupt Flag
  *            @arg DMA2D_FLAG_LCLIE :  Linear command list instruction error Interrupt Flag
  *            @arg DMA2D_FLAG_LCLRE :  Linear command list read error Interrupt Flag
  *            @arg DMA2D_FLAG_GPF3S :  The command list is suspended by GPFLAG 3 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF2S :  The command list is suspended by GPFLAG 2 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF1S :  The command list is suspended by GPFLAG 1 Interrupt Flag
  *            @arg DMA2D_FLAG_GPF0S :  The command list is suspended by GPFLAG 0 Interrupt Flag
  *            @arg DMA2D_FLAG_SUSPS :  The command list is suspended by the SUSP bit Interrupt Flag
  * @retval None
  */
#define __HAL_DMA2D_CL_GET_GPFLAG_SUSPEND(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->CLSR & (__FLAG__))

/**
  * @brief  Enable the specified DMA2D interrupts.
  * @param  __HANDLE__ DMA2D handle
  * @param __INTERRUPT__ specifies the DMA2D interrupt sources to be enabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_IT_CE:  Configuration error interrupt mask
  *            @arg DMA2D_IT_CTC: CLUT transfer complete interrupt mask
  *            @arg DMA2D_IT_CAE: CLUT access error interrupt mask
  *            @arg DMA2D_IT_TW:  Transfer Watermark interrupt mask
  *            @arg DMA2D_IT_TC:  Transfer complete interrupt mask
  *            @arg DMA2D_IT_TE:  Transfer error interrupt mask
  *            @arg DMA2D_IT_GPF3: General Purpose Flag 3 interrupt mask
  *            @arg DMA2D_IT_GPF2: General Purpose Flag 2 interrupt mask
  *            @arg DMA2D_IT_GPF1: General Purpose Flag 1 interrupt mask
  *            @arg DMA2D_IT_GPF0: General Purpose Flag 0 interrupt mask
  *            @arg DMA2D_IT_CLE : Command List Error interrupt mask
  *            @arg DMA2D_IT_CLS : Command List Suspended interrupt mask
  *            @arg DMA2D_IT_RBE : Ring Buffer Error interrupt mask
  *            @arg DMA2D_IT_RBC : Ring Buffer Completed interrupt mask
  * @retval None
  */
#define __HAL_DMA2D_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER |= (__INTERRUPT__))

/**
  * @brief  Disable the specified DMA2D interrupts.
  * @param  __HANDLE__ DMA2D handle
  * @param __INTERRUPT__ specifies the DMA2D interrupt sources to be disabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA2D_IT_CE:  Configuration error interrupt mask
  *            @arg DMA2D_IT_CTC: CLUT transfer complete interrupt mask
  *            @arg DMA2D_IT_CAE: CLUT access error interrupt mask
  *            @arg DMA2D_IT_TW:  Transfer Watermark interrupt mask
  *            @arg DMA2D_IT_TC:  Transfer complete interrupt mask
  *            @arg DMA2D_IT_TE:  Transfer error interrupt mask
  *            @arg DMA2D_IT_GPF3: General Purpose Flag 3 interrupt mask
  *            @arg DMA2D_IT_GPF2: General Purpose Flag 2 interrupt mask
  *            @arg DMA2D_IT_GPF1: General Purpose Flag 1 interrupt mask
  *            @arg DMA2D_IT_GPF0: General Purpose Flag 0 interrupt mask
  *            @arg DMA2D_IT_CLE : Command List Error interrupt mask
  *            @arg DMA2D_IT_CLS : Command List Suspended interrupt mask
  *            @arg DMA2D_IT_RBE : Ring Buffer Error interrupt mask
  *            @arg DMA2D_IT_RBC : Ring Buffer Completed interrupt mask
  * @retval None
  */
#define __HAL_DMA2D_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER &= ~(__INTERRUPT__))

/**
  * @brief  Check whether the specified DMA2D interrupt source is enabled or not.
  * @param  __HANDLE__ DMA2D handle
  * @param  __INTERRUPT__ specifies the DMA2D interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg DMA2D_IT_CE:  Configuration error interrupt mask
  *            @arg DMA2D_IT_CTC: CLUT transfer complete interrupt mask
  *            @arg DMA2D_IT_CAE: CLUT access error interrupt mask
  *            @arg DMA2D_IT_TW:  Transfer Watermark interrupt mask
  *            @arg DMA2D_IT_TC:  Transfer complete interrupt mask
  *            @arg DMA2D_IT_TE:  Transfer error interrupt mask
  *            @arg DMA2D_IT_GPF3: General Purpose Flag 3 interrupt mask
  *            @arg DMA2D_IT_GPF2: General Purpose Flag 2 interrupt mask
  *            @arg DMA2D_IT_GPF1: General Purpose Flag 1 interrupt mask
  *            @arg DMA2D_IT_GPF0: General Purpose Flag 0 interrupt mask
  *            @arg DMA2D_IT_CLE : Command List Error interrupt mask
  *            @arg DMA2D_IT_CLS : Command List Suspended interrupt mask
  *            @arg DMA2D_IT_RBE : Ring Buffer Error interrupt mask
  *            @arg DMA2D_IT_RBC : Ring Buffer Completed interrupt mask
  * @retval The state of INTERRUPT source.
  */
#define __HAL_DMA2D_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER & (__INTERRUPT__))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DMA2D_Exported_Functions DMA2D Exported Functions
  * @{
  */
#if (USE_DMA2D_COMMAND_LIST_MODE == 0)
/** @addtogroup DMA2D_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

