zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
#define IS_DMA2D_INPUT_COLOR_MODE(INPUT_CM)   (((INPUT_CM) == DMA2D_INPUT_ARGB8888) || \
                                               ((INPUT_CM) == DMA2D_INPUT_RGB888)   || \
                                               ((INPUT_CM) == DMA2D_INPUT_RGB565)   || \
                                               ((INPUT_CM) == DMA2D_INPUT_ARGB1555) || \
                                               ((INPUT_CM) == DMA2D_INPUT_ARGB4444) || \
                                               ((INPUT_CM) == DMA2D_INPUT_L8)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_AL44)     || \
                                               ((INPUT_CM) == DMA2D_INPUT_AL88)     || \
                                               ((INPUT_CM) == DMA2D_INPUT_L4)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_A8)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_A4)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_YCBCR)    || \
                                               ((INPUT_CM) == DMA2D_INPUT_A2)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_A1)       || \
                                               ((INPUT_CM) == DMA2D_INPUT_ARGB2222))

#define IS_DMA2D_ALPHA_MODE(AlphaMode)        (((AlphaMode) == DMA2D_NO_MODIF_ALPHA) || \
                                               ((AlphaMode) == DMA2D_REPLACE_ALPHA)  || \
                                               ((AlphaMode) == DMA2D_COMBINE_ALPHA))

#define IS_DMA2D_ALPHA_INVERTED(Alpha_Inverted) (((Alpha_Inverted) == DMA2D_REGULAR_ALPHA) || \
                                                 ((Alpha_Inverted) == DMA2D_INVERTED_ALPHA))

#define IS_DMA2D_RB_SWAP(RB_Swap) (((RB_Swap) == DMA2D_RB_REGULAR) || \
                                   ((RB_Swap) == DMA2D_RB_SWAP))

#define IS_DMA2D_LOM_MODE(LOM)          (((LOM) == DMA2D_LOM_PIXELS) || \
                                         ((LOM) == DMA2D_LOM_BYTES))

#define IS_DMA2D_BYTES_SWAP(BYTES_SWAP) (((BYTES_SWAP) == DMA2D_BYTES_REGULAR) || \
                                         ((BYTES_SWAP) == DMA2D_BYTES_SWAP))

#define IS_DMA2D_CHROMA_SUB_SAMPLING(CSS) (((CSS) == DMA2D_NO_CSS)  || \
                                           ((CSS) == DMA2D_CSS_422) || \
                                           ((CSS) == DMA2D_CSS_420))
#define IS_DMA2D_ALPHA_POSITION(AlphaPosition) (((AlphaPosition) == DMA2D_REGULAR_ALPHA_POS) || \
                                                ((AlphaPosition) == DMA2D_SWAP_ALPHA_POS))

#define IS_DMA2D_ROT_SRC(ROT_SRC) (((ROT_SRC) == DMA2D_SOURCE_NONE)  || \
                                   ((ROT_SRC) == DMA2D_SOURCE_FOREGROUND)  || \
                                   ((ROT_SRC) == DMA2D_SOURCE_BACKGROUND)  || \
                                   ((ROT_SRC) == DMA2D_SOURCE_BLENDER_OUTPUT))
#define IS_DMA2D_ROT_TYPE(ROT_TYPE) (((ROT_TYPE) == DMA2D_NO_ROTATION)   || \
                                     ((ROT_TYPE) == DMA2D_NO_ROTATION_FLIP)                || \
                                     ((ROT_TYPE) == DMA2D_ROTATE_90)                || \
                                     ((ROT_TYPE) == DMA2D_ROTATE_90_FLIP)              || \
                                     ((ROT_TYPE) == DMA2D_ROTATE_180)              || \
                                     ((ROT_TYPE) == DMA2D_ROTATE_180_FLIP)               || \
                                     ((ROT_TYPE) == DMA2D_ROTATE_270)|| \
                                     ((ROT_TYPE) == DMA2D_ROTATE_270_FLIP))

#define IS_DMA2D_SKIP_PIXEL_VALUE(value) ((value) <= 0xFU)
#define IS_DMA2D_STENCIL_MODE(mode) (((mode) == DMA2D_STENCIL_MODE_A1) || \
                                     ((mode) == DMA2D_STENCIL_MODE_A2) || \
                                     ((mode) == DMA2D_STENCIL_MODE_A4) || \
                                     ((mode) == DMA2D_STENCIL_MODE_A8))
#define IS_DMA2D_STENCIL_LO(LO) ((LO) <= 0xFFFFU)
#define IS_DMA2D_STENCIL_HPRE(HPRE) ((HPRE) <= 0xFU)
#define IS_DMA2D_STENCIL_HTRAIL(HTAIL) ((HTAIL) <= 0xFU)
#define IS_DMA2D_STENCIL_ALPHA_INVERTED(ALPHA_INV) (((ALPHA_INV) == DMA2D_REGULAR_ALPHA) || \
                                                    ((ALPHA_INV) == DMA2D_INVERTED_ALPHA))
#define IS_DMA2D_SCALE_SRC(SCALE_SRC) (((SCALE_SRC) == DMA2D_SOURCE_NONE)  || \
                                       ((SCALE_SRC) == DMA2D_SOURCE_FOREGROUND)  || \
                                       ((SCALE_SRC) == DMA2D_SOURCE_BACKGROUND)  || \
                                       ((SCALE_SRC) == DMA2D_SOURCE_BLENDER_OUTPUT))

#define IS_DMA2D_SCALE_VSTEP(VSTEP) ((VSTEP) <= 0xFFFU)
#define IS_DMA2D_SCALE_HSTEP(HSTEP) ((HSTEP) <= 0xFFFU)
#define IS_DMA2D_SCALE_NUMBER_OF_LINES(NL) ((NL) <= 0xFFFFU)
#define IS_DMA2D_SCALE_PIXEL_PER_LINE(PL) ((PL) <= 0x3FFFU)
#define IS_DMA2D_SCALE_HPHASE(HPHASE) ((HPHASE) <= 0xFFFU)
#define IS_DMA2D_SCALE_VPHASE(VPHASE) ((VPHASE) <= 0xFFFU)

#define IS_DMA2D_STENCIL_SRC(STENCIL_SRC) (((STENCIL_SRC) == DMA2D_SOURCE_NONE)  || \
                                           ((STENCIL_SRC) == DMA2D_SOURCE_FOREGROUND)  || \
                                           ((STENCIL_SRC) == DMA2D_SOURCE_BACKGROUND)  || \
                                           ((STENCIL_SRC) == DMA2D_SOURCE_BLENDER_OUTPUT))
#define IS_DMA2D_CLUT_CM(CLUT_CM)        (((CLUT_CM) ==  DMA2D_CCM_ARGB8888)|| ((CLUT_CM) == DMA2D_CCM_RGB888) ||\
                                          ((CLUT_CM) ==  DMA2D_CCM_RGB565) || ((CLUT_CM) ==  DMA2D_CCM_ARGB1555)||\
                                          ((CLUT_CM) ==  DMA2D_CCM_ARGB4444) || ((CLUT_CM) ==  DMA2D_CCM_ARGB2222))
#define IS_DMA2D_CLUT_SIZE(CLUT_SIZE)         ((CLUT_SIZE) <= DMA2D_CLUT_SIZE)
#define IS_DMA2D_LINEWATERMARK(LineWatermark) ((LineWatermark) <= DMA2D_LINE_WATERMARK_MAX)
#define IS_DMA2D_IT(IT)                       (((IT) == DMA2D_IT_CE)    || ((IT) == DMA2D_IT_CTC)  || \
                                               ((IT) == DMA2D_IT_CAE)   || ((IT) == DMA2D_IT_TW)   || \
                                               ((IT) == DMA2D_IT_TC)    || ((IT) == DMA2D_IT_TE)   || \
                                               ((IT) == DMA2D_IT_GPF3)  || ((IT) == DMA2D_IT_GPF2) || \
                                               ((IT) == DMA2D_IT_GPF1)  || ((IT) == DMA2D_IT_GPF0) || \
                                               ((IT) == DMA2D_IT_CLE)   || ((IT) == DMA2D_IT_CLS)  || \
                                               ((IT) == DMA2D_IT_RBE)   || ((IT) == DMA2D_IT_RBC)  || \
                                               ((IT) == DMA2D_IT_ALL))

