zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_dma2d.h
#define IS_DMA2D_GET_FLAG(FLAG)               (((FLAG) == DMA2D_FLAG_CE)     || ((FLAG) == DMA2D_FLAG_CTC)    || \
                                               ((FLAG) == DMA2D_FLAG_CAE)    || ((FLAG) == DMA2D_FLAG_TW)     || \
                                               ((FLAG) == DMA2D_FLAG_TC)     || ((FLAG) == DMA2D_FLAG_TE)     || \
                                               ((FLAG) == DMA2D_FLAG_GPF3I)  || ((FLAG) == DMA2D_FLAG_GPF2I)  || \
                                               ((FLAG) == DMA2D_FLAG_GPF1I)  || ((FLAG) == DMA2D_FLAG_GPF0I)  || \
                                               ((FLAG) == DMA2D_FLAG_CLE)    || ((FLAG) == DMA2D_FLAG_CLS)    || \
                                               ((FLAG) == DMA2D_FLAG_RBE)    || ((FLAG) == DMA2D_FLAG_RBC)    || \
                                               ((FLAG) == DMA2D_FLAG_LCLMSE) || ((FLAG) == DMA2D_FLAG_LCLIE)  || \
                                               ((FLAG) == DMA2D_FLAG_LCLRE)  || ((FLAG) == DMA2D_FLAG_GPF3S)  || \
                                               ((FLAG) == DMA2D_FLAG_GPF2S)  || ((FLAG) == DMA2D_FLAG_GPF1S)  || \
                                               ((FLAG) == DMA2D_FLAG_GPF0S)  || ((FLAG) == DMA2D_FLAG_SUSPS))
#define IS_DMA2D_CL_RB_SIZE(SIZE) (((SIZE) == DMA2D_RB_SIZE_64B)   || \
                                   ((SIZE) == DMA2D_RB_SIZE_128B)  || \
                                   ((SIZE) == DMA2D_RB_SIZE_256B)  || \
                                   ((SIZE) == DMA2D_RB_SIZE_512B)  || \
                                   ((SIZE) == DMA2D_RB_SIZE_1KB) || \
                                   ((SIZE) == DMA2D_RB_SIZE_2KB) || \
                                   ((SIZE) == DMA2D_RB_SIZE_4KB) || \
                                   ((SIZE) == DMA2D_RB_SIZE_8KB))
#define IS_DMA2D_CL_ADDRESS_RB_VALID(Address) (((Address) != 0x0U) && (((Address) & 0x7) == 0x0U))
#define IS_DMA2D_CL_ADDRESS_VALID(Address) (((Address) != 0x0U) && (((Address) & 0x7) == 0x0U))
#define IS_DMA2D_CL_SIZE(Size) ((Size) <= 4096)

#define IS_DMA2D_CL_PRE_POST_FLAG_OPERATION(flag_operation) ((flag_operation == DMA2D_GPFLAG_NOP)   ||\
                                                             (flag_operation == DMA2D_GPFLAG_SET)   ||\
                                                             (flag_operation == DMA2D_GPFLAG_RESET) ||\
                                                             (flag_operation == DMA2D_GPFLAG_TOGGLE))
#define IS_DMA2D_CL_GPFLAG(GPFLAG) ((GPFLAG == DMA2D_GPFLAG0) ||\
                                    (GPFLAG == DMA2D_GPFLAG1) ||\
                                    (GPFLAG == DMA2D_GPFLAG2) ||\
                                    (GPFLAG == DMA2D_GPFLAG3))
#define IS_DMA2D_CL_GPFLAG_INTERRUPT_MODE(mode) (((mode) == DMA2D_GPFLAG_NONE)    || \
                                                 ((mode) == DMA2D_GPFLAG_RISING)  || \
                                                 ((mode) == DMA2D_GPFLAG_FALLING) || \
                                                 ((mode) == DMA2D_GPFLAG_RISING_FALLING))
#define IS_DMA2D_CL_IT(IT) (((IT) == DMA2D_IT_CE)  || ((IT) == DMA2D_IT_CTC) || \
                            ((IT) == DMA2D_IT_CAE) || ((IT) == DMA2D_IT_TW)  || \
                            ((IT) == DMA2D_IT_TC)  || ((IT) == DMA2D_IT_TE)  || \
                            ((IT) == DMA2D_IT_GPF3) || ((IT) == DMA2D_IT_GPF2) || \
                            ((IT) == DMA2D_IT_GPF1) || ((IT) == DMA2D_IT_GPF0) || \
                            ((IT) == DMA2D_IT_CLE) || ((IT) == DMA2D_IT_CLS) || \
                            ((IT) == DMA2D_IT_RBE) || ((IT) == DMA2D_IT_RBC) || ((IT) == DMA2D_IT_ALL))
/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (DMA2D) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H5xx_HAL_DMA2D_H */
